config.org
** Org Roam
#+begin_src emacs-lisp
(use-package! org-roam
  :after org
  :config
    (advice-remove 'org-roam-db-query '+org-roam-try-init-db-a))
(use-package! org-roam
        :config
        (setq org-roam-capture-templates
        '(("m" "main" plain
        "%?"
        :if-new (file+head "main/${slug}.org"
        "#+title: ${title}\n#+filetags:\n")
        :immediate-finish t
        :unnarrowed t)

        ("r" "reference" plain "%?"
        :if-new
        (file+head "reference/${slug}.org" "#+title: ${title}\n#+filetags: \n- source :: \n\n ")
        :immediate-finish t
        :unnarrowed t)

        ("P" "people" plain "%?"
        :if-new
        (file+head "people/${slug}.org" "#+title: ${title}\n#+filetags: \n* Company\n* Contact Info\n* Job title\n ")
        :immediate-finish t
        :unnarrowed t)

        ("p" "paper" plain "%?"
        :if-new
        (file+head "papers/${slug}.org" "${title}\n#+filetags: :paper:\n- source ::  \n \n* TLDR \n* Research Gap \n* Limitations \n* Contribution \n* Open Questions\n* Evidence\n* Other")
        :immediate-finish t
        :unnarrowed t)

        ("M" "meeting" plain "%?"
        :if-new
        (file+head "meetings/%<%Y%m%d%S>-${slug}.org" "Meeting of : %t\n#+filetags: :meeting:\n")
        :immediate-finish t
        :unnarrowed t)

        ("b" "book notes" plain
        "\n* Source\n\nAuthor: %^{Author}\nTitle: ${title}\nYear: %^{Year}\n\n* Summary\n\n%?"
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
        :unnarrowed t)))
(setq org-roam-dailies-capture-templates
      '(("d" "daily" entry
         "* %?"
         :target (file+head "%<%Y-%m-%d>.org"
                           "#+title: %<%Y-%m-%d %a>\n#+filetags:\n\n#+BEGIN: clocktable\n#+END:\n\n* The one thing \n* Today \n* Tasks [/] [%] \n - [ ] Stretch\n - [ ] Workout\n - [ ] Anki\n - [ ]\n\n* Daily Review\n** Achievement Review [0/3]\n - [ ] What did I accomplish today?\n - [ ] What went well today?\n - [ ] What's my biggest win?\n\n** Progress Tracking [0/4]\n - [ ] Career Goal Progress: [Rating 1-10] \n   - Notes:\n - [ ] Financial Goal Progress: [Rating 1-10]\n   - Notes:\n - [ ] Personal Development Progress: [Rating 1-10]\n   - Notes:\n - [ ] Health Goal Progress: [Rating 1-10]\n   - Notes:\n\n** Learning & Insights\n - What did I learn today?\n - What could I have done better?\n\n** Tomorrow's Priorities\n - Priority 1:\n - Priority 2:\n - Priority 3:"))
        ("w" "weekly" entry
         "* Weekly Review: Week %<%U>"
         :target (file+head "weekly/W%<%V_%Y>.org"
                           "#+title: Weekly Review: %<%Y-W%V>\n#+filetags: :weekly_review:\n\n* Achievement Review\n** Completed Tasks This Week\n%?\n** Major Milestones/Wins\n- \n** Missed Tasks/Opportunities\n- \n\n* Goal Progress Analysis\n** Career\n- Progress: [Rating 1-10]\n- Key accomplishments:\n- Challenges:\n- Next week's focus:\n\n** Financial\n- Savings this week:\n- Progress toward monthly goal: \n- Unexpected expenses:\n- Next week's financial priority:\n\n** Personal Development\n- Books/articles read:\n- Skills practiced:\n- Progress: [Rating 1-10]\n- Next week's focus:\n\n** Health\n- Workout consistency: [Rating 1-10]\n- Sleep quality: [Rating 1-10]\n- Nutrition quality: [Rating 1-10]\n- Next week's health priority:\n\n* Environmental Assessment\n** Changes/New Developments\n- \n** New Opportunities\n- \n** New Challenges\n- \n\n* Next Week\n** Top 3 Priorities\n1. \n2. \n3. \n\n** Specific Action Steps\n- [ ] \n- [ ] \n- [ ] \n\n* Vision Alignment Check\nAm I still aligned with my Vision 2028? [Yes/No]\nNotes:"))
        ("m" "monthly" entry
         "* Monthly Review: %<%B %Y>"
         :target (file+head "monthly/M%<%m_%Y>.org"
                           "#+title: Monthly Review: %<%B %Y>\n#+filetags: :monthly_review:\n\n* Month Overview\n%?\n** Key highlights:\n- \n** Challenges:\n- \n\n* Achievement Review\n** Monthly Goals Completed\n- \n** Monthly Goals Not Completed\n- \n** Unexpected Achievements\n- \n\n* Goal Progress Tracking\n** Career \n- Progress: [Rating 1-10]\n- Key accomplishments:\n- Learning/growth areas:\n- Relationships built:\n- Skills developed:\n- Next month's focus:\n\n** Financial\n- Monthly income:\n- Monthly expenses:\n- Savings rate: \n- Progress toward yearly goal (%):\n- Next month's financial priority:\n\n** Personal Development\n- Books completed:\n- Courses/training completed:\n- New skills practiced:\n- Habits built/maintained:\n- Areas needing improvement:\n- Next month's focus:\n\n** Health\n- Weight/body composition changes:\n- Strength/fitness improvements:\n- Sleep metrics:\n- Energy levels:\n- Areas needing attention:\n- Next month's health priority:\n\n* Resource Evaluation\n** What resources do I need to achieve next month's goals?\n- \n** What relationships should I nurture?\n- \n** What training/learning do I need?\n- \n\n* Vision Alignment Check\n** Progress toward 3-year vision:\n- Career: [Rating 1-10]\n- Financial: [Rating 1-10]\n- Personal Development: [Rating 1-10]\n- Social: [Rating 1-10]\n- Health: [Rating 1-10]\n\n** Adjustments needed to vision or approach:\n- \n\n* Quarter Planning (if applicable)\n** Quarter goals and focus areas:\n-"))
      )
))
#+end_src
** Org Pomodoro Statusbar
#+begin_src emacs-lisp
(defun ruborcalor/org-pomodoro-time ()
  "Return the remaining pomodoro time"
  (if (org-pomodoro-active-p)
      (cl-case org-pomodoro-state
        (:pomodoro
           (format "Pomo: %d minutes - %s" (/ (org-pomodoro-remaining-seconds) 60) org-clock-heading))
        (:short-break
         (format "Short break time: %d minutes" (/ (org-pomodoro-remaining-seconds) 60)))
        (:long-break
         (format "Long break time: %d minutes" (/ (org-pomodoro-remaining-seconds) 60)))
        (:overtime
         (format "Overtime! %d minutes" (/ (org-pomodoro-remaining-seconds) 60))))
    "No active pomo"))
#+end_src
** Org-auto-tangle
#+begin_src emacs-lisp
(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))
#+end_src
** Org Capture
#+begin_src emacs-lisp
(use-package! anki-editor
  :commands (anki-editor-mode)
  :init
  (map! :leader
      :desc "Anki Push tree"
      "m a p" #'anki-editor-push-new-notes)
  :hook (org-capture-after-finalize . anki-editor-reset-cloze-number) ; Reset cloze-number after each capture.
)
;; Org-capture templates
(setq org-my-anki-file "~/org/anki.org")
(defun my-anki-editor-mode-hook ()
  (when (string-equal (buffer-file-name) (expand-file-name "~/org/anki.org"))
    (anki-editor-mode)))

(add-hook 'find-file-hook 'my-anki-editor-mode-hook)

(after! org
    (add-to-list 'org-capture-templates
    '("a" "Anki basic"
               entry
               (file+headline org-my-anki-file "Dispatch Shelf")
               "* %<%H:%M>   %^g\n:PROPERTIES:\n:ANKI_NOTE_TYPE: Basic\n:ANKI_DECK: Mega\n:END:\n** Front\n%?\n** Back\n"))
    (add-to-list 'org-capture-templates
             '("A" "Anki cloze"
               entry
               (file+headline org-my-anki-file "Dispatch Shelf")
               "* %<%H:%M>   %^g\n:PROPERTIES:\n:ANKI_NOTE_TYPE: Cloze\n:ANKI_DECK: Mega\n:END:\n** Text\n%x\n** Extra\n"))
    (add-to-list 'org-capture-templates
                '("g" "Game Dev Notes"
                  entry
                  (file+headline "~/org/my_rpg.org" "Capture")
                   "* %?\nEntered on %U\n  %i\n  %a"))
    (add-to-list 'org-capture-templates
                '("r" "Reading List"
                  entry
                  (file+headline "~/org/reading_list.org" "Capture")
                   "* %?Title\nby Author \n\nEntered on %U\n  %i\n  %a \n "))
    (add-to-list 'org-capture-templates
                '("n" "Notes"
                  entry
                  (file+headline "~/org/gtd/notes.org" "Capture")
                   "* %?\n  %i\n  %a"))
    (add-to-list 'org-capture-templates
                '("t" "ToDo"
                  entry
                  (file+headline "~/org/gtd/inbox.org" "Capture")
                   "* TODO %?\n  %i\n  %a")))
;; Allow Emacs to access content from clipboard.
(setq select-enable-clipboard t
      select-enable-primary t)

(defadvice org-capture-finalize
    (after delete-capture-frame activate)
  "Advise capture-finalize to close the frame"
  (if (equal "org-capture" (frame-parameter nil 'name))
      (delete-frame)))

(defadvice org-capture-destroy
    (after delete-capture-frame activate)
  "Advise capture-destroy to close the frame"
  (if (equal "org-capture" (frame-parameter nil 'name))
      (delete-frame)))

(defun make-orgcapture-frame ()
    "Create a new frame and run org-capture."
    (interactive)
    (make-frame '((name . "org-capture") (window-system . x)))
    (select-frame-by-name "org-capture")
    (org-capture)
    ;;(delete-other-windows)
    )
#+end_src
** Org agenda
#+begin_src emacs-lisp
(setq org-agenda-custom-commands
      '(("d" "Completed tasks today"
         agenda ""
         ((org-agenda-start-day "+0d")
          (org-agenda-span 1)
          (org-agenda-entry-types '(:closed))))))

#+end_src
* Packages
** Leetcode
#+begin_src emacs-lisp
(setq leetcode-prefer-language "rust")
(setq leetcode-save-solutions t)
(setq leetcode-directory "~/code/leetcode")
#+end_src
** vterm
#+begin_src emacs-lisp
(setq vterm-shell "/etc/profiles/per-user/vincenzo/bin/nu")
#+end_src
