config.el

;; [[file:config.org::*Org Roam][Org Roam:1]]
(use-package! org-roam
  :after org
  :config
    (advice-remove 'org-roam-db-query '+org-roam-try-init-db-a))
(use-package! org-roam
        :config
        (setq org-roam-capture-templates
        '(("m" "main" plain
        "%?"
        :if-new (file+head "main/${slug}.org"
        "#+title: ${title}\n#+filetags:\n")
        :immediate-finish t
        :unnarrowed t)

        ("r" "reference" plain "%?"
        :if-new
        (file+head "reference/${slug}.org" "#+title: ${title}\n#+filetags: \n- source :: \n\n ")
        :immediate-finish t
        :unnarrowed t)

        ("P" "people" plain "%?"
        :if-new
        (file+head "people/${slug}.org" "#+title: ${title}\n#+filetags: \n* Company\n* Contact Info\n* Job title\n ")
        :immediate-finish t
        :unnarrowed t)

        ("p" "paper" plain "%?"
        :if-new
        (file+head "papers/${slug}.org" "${title}\n#+filetags: :paper:\n- source ::  \n \n* TLDR \n* Research Gap \n* Limitations \n* Contribution \n* Open Questions\n* Evidence\n* Other")
        :immediate-finish t
        :unnarrowed t)

        ("M" "meeting" plain "%?"
        :if-new
        (file+head "meetings/%<%Y%m%d%S>-${slug}.org" "Meeting of : %t\n#+filetags: :meeting:\n")
        :immediate-finish t
        :unnarrowed t)

        ("b" "book notes" plain
        "\n* Source\n\nAuthor: %^{Author}\nTitle: ${title}\nYear: %^{Year}\n\n* Summary\n\n%?"
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
        :unnarrowed t)))
(setq org-roam-dailies-capture-templates
      '(("d" "default" entry
                        "* %?"
                        :target (file+head "%<%Y-%m-%d>.org"
"#+title: %<%Y-%m-%d %a>
#+filetags:

#+BEGIN: clocktable
#+END:
\n* The one thing \n* Today \n* Tasks [/] [%] \n - [ ] Stretch\n - [ ] Workout\n - [ ] Anki\n

      ")
    )
  )
))
;; Org Roam:1 ends here

;; [[file:config.org::*Org Pomodoro Statusbar][Org Pomodoro Statusbar:1]]
(defun ruborcalor/org-pomodoro-time ()
  "Return the remaining pomodoro time"
  (if (org-pomodoro-active-p)
      (cl-case org-pomodoro-state
        (:pomodoro
           (format "Pomo: %d minutes - %s" (/ (org-pomodoro-remaining-seconds) 60) org-clock-heading))
        (:short-break
         (format "Short break time: %d minutes" (/ (org-pomodoro-remaining-seconds) 60)))
        (:long-break
         (format "Long break time: %d minutes" (/ (org-pomodoro-remaining-seconds) 60)))
        (:overtime
         (format "Overtime! %d minutes" (/ (org-pomodoro-remaining-seconds) 60))))
    "No active pomo"))
;; Org Pomodoro Statusbar:1 ends here

;; [[file:config.org::*Org-auto-tangle][Org-auto-tangle:1]]
(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))
;; Org-auto-tangle:1 ends here

;; [[file:config.org::*Org Capture][Org Capture:1]]
(use-package! anki-editor
  :commands (anki-editor-mode)
  :init
  (map! :leader
      :desc "Anki Push tree"
      "m a p" #'anki-editor-push-new-notes)
  :hook (org-capture-after-finalize . anki-editor-reset-cloze-number) ; Reset cloze-number after each capture.
)
;; Org-capture templates
(setq org-my-anki-file "~/org/anki.org")
(defun my-anki-editor-mode-hook ()
  (when (string-equal (buffer-file-name) (expand-file-name "~/org/anki.org"))
    (anki-editor-mode)))

(add-hook 'find-file-hook 'my-anki-editor-mode-hook)

(after! org
    (add-to-list 'org-capture-templates
    '("a" "Anki basic"
               entry
               (file+headline org-my-anki-file "Dispatch Shelf")
               "* %<%H:%M>   %^g\n:PROPERTIES:\n:ANKI_NOTE_TYPE: Basic\n:ANKI_DECK: Mega\n:END:\n** Front\n%?\n** Back\n"))
    (add-to-list 'org-capture-templates
             '("A" "Anki cloze"
               entry
               (file+headline org-my-anki-file "Dispatch Shelf")
               "* %<%H:%M>   %^g\n:PROPERTIES:\n:ANKI_NOTE_TYPE: Cloze\n:ANKI_DECK: Mega\n:END:\n** Text\n%x\n** Extra\n"))
    (add-to-list 'org-capture-templates
                '("g" "Game Dev Notes"
                  entry
                  (file+headline "~/org/my_rpg.org" "Capture")
                   "* %?\nEntered on %U\n  %i\n  %a"))
    (add-to-list 'org-capture-templates
                '("r" "Reading List"
                  entry
                  (file+headline "~/org/reading_list.org" "Capture")
                   "* %?Title\nby Author \n\nEntered on %U\n  %i\n  %a \n "))
    (add-to-list 'org-capture-templates
                '("n" "Notes"
                  entry
                  (file+headline "~/org/gtd/notes.org" "Capture")
                   "* %?\n  %i\n  %a"))
    (add-to-list 'org-capture-templates
                '("t" "ToDo"
                  entry
                  (file+headline "~/org/gtd/inbox.org" "Capture")
                   "* TODO %?\n  %i\n  %a")))
;; Allow Emacs to access content from clipboard.
(setq select-enable-clipboard t
      select-enable-primary t)

(defadvice org-capture-finalize
    (after delete-capture-frame activate)
  "Advise capture-finalize to close the frame"
  (if (equal "org-capture" (frame-parameter nil 'name))
      (delete-frame)))

(defadvice org-capture-destroy
    (after delete-capture-frame activate)
  "Advise capture-destroy to close the frame"
  (if (equal "org-capture" (frame-parameter nil 'name))
      (delete-frame)))

(defun make-orgcapture-frame ()
    "Create a new frame and run org-capture."
    (interactive)
    (make-frame '((name . "org-capture") (window-system . x)))
    (select-frame-by-name "org-capture")
    (org-capture)
    ;;(delete-other-windows)
    )
;; Org Capture:1 ends here

;; [[file:config.org::*Org agenda][Org agenda:1]]
(setq org-agenda-custom-commands
      '(("d" "Completed tasks today"
         agenda ""
         ((org-agenda-start-day "+0d")
          (org-agenda-span 1)
          (org-agenda-entry-types '(:closed))))))
;; Org agenda:1 ends here

;; [[file:config.org::*Leetcode][Leetcode:1]]
(setq leetcode-prefer-language "rust")
(setq leetcode-save-solutions t)
(setq leetcode-directory "~/code/leetcode")
;; Leetcode:1 ends here

;; [[file:config.org::*vterm][vterm:1]]
(setq vterm-shell "/etc/profiles/per-user/vincenzo/bin/nu")
;; vterm:1 ends here
