config.org
* Japanese
#+begin_src emacs-lisp
(setq fcitx-use-dbus nil
      fcitx-remote-command "fcitx5-remote")
;;(setq fcitx-use-dbus "fcitx5")
(fcitx-aggressive-setup)
#+end_src
