config.el

;; [[file:config.org::*Japanese][Japanese:1]]
(setq fcitx-use-dbus nil
      fcitx-remote-command "fcitx5-remote")
;;(setq fcitx-use-dbus "fcitx5")
(fcitx-aggressive-setup)
;; Japanese:1 ends here
